src/Tasks/ЗадачаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Task>
		<Properties>
			<Name>ЗадачаПользователей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Comment>Дата и время фактического выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаТема</Name>
					<Comment>Содержание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПредмет</Name>
					<Comment>Предмет задачи</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаАвтор</Name>
					<Comment>Автор бизнес-процесса, который сформировал задачу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОписание</Name>
					<Comment>Подробное описание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаНазначеннаяДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеИспользовать</Name>
					<Comment>Напоминать о задаче</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеРежим</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНапоминаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЗадачи</Name>
					<Comment>Представление задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

src/Enums/ВариантыНапоминаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыНапоминаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЧерезУказанноеВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСобытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВУказанноеВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаВремяОтносительноСобытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПосещению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВМоментСозданияЗадачи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Tasks/ЗадачаПользователей/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Получить текущие задачи для пользователя определенных временем срабатывания 
Функция ПолучитьТекущиеЗадачиДляПользователяПоВремени(Пользователь = Неопределено, СтруктурнаяЕдиница = Неопределено) Экспорт
	
	ЗапросВыборка = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                             |	ЗадачаПользователей.Ссылка
	                             |ИЗ
	                             |	Задача.ЗадачаПользователей КАК ЗадачаПользователей
	                             |ГДЕ
								 |	ЗадачаПользователей.ПометкаУдаления = ЛОЖЬ
								 |	И ЗадачаПользователей.Выполнена = ЛОЖЬ
	                             |	И ЗадачаПользователей.НапоминаниеИспользовать = ИСТИНА
	                             |	И ЗадачаПользователей.НапоминаниеДатаНачала < &ТекущаяДата
								 |	И ВЫБОР
	                             |		КОГДА &ИсполнительИспользовать = ИСТИНА
	                             |			ТОГДА ВЫБОР
	                             |					КОГДА ЗадачаПользователей.Исполнитель ССЫЛКА Справочник.Пользователи И ЗадачаПользователей.Исполнитель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	                             |						ТОГДА ЗадачаПользователей.Исполнитель = &Исполнитель
	                             |					КОГДА ЗадачаПользователей.Исполнитель ССЫЛКА Справочник.ГруппыПользователей И ЗадачаПользователей.Исполнитель <> ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ПустаяСсылка)
	                             |						ТОГДА &Исполнитель В
	                             |								(ВЫБРАТЬ
	                             |									СоставГруппыПользователей.Пользователь
	                             |								ИЗ
	                             |									Справочник.ГруппыПользователей.Состав КАК СоставГруппыПользователей
	                             |								ГДЕ
	                             |									СоставГруппыПользователей.Ссылка = ЗадачаПользователей.Исполнитель)
	                             |							ИЛИ ЗадачаПользователей.Исполнитель = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	                             |					ИНАЧЕ ИСТИНА
	                             |				КОНЕЦ
	                             |		ИНАЧЕ ИСТИНА
	                             |		КОНЕЦ
	                             |	И ВЫБОР
	                             |			КОГДА &СтруктурнаяЕдиницаИспользовать = ИСТИНА
	                             |				ТОГДА ЗадачаПользователей.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                             |			ИНАЧЕ ИСТИНА
	                             |		КОНЕЦ
	                             |	И ВЫБОР
	                             |			КОГДА ЗадачаПользователей.НапоминаниеРежим <> ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ПоСобытию)
	                             |					И ЗадачаПользователей.НапоминаниеДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	                             |				ТОГДА &ТекущаяДата > ЗадачаПользователей.НапоминаниеДатаНачала
	                             |			ИНАЧЕ ЛОЖЬ
	                             |		КОНЕЦ");
	
	
	ЗапросВыборка.УстановитьПараметр("ТекущаяДата", ТекущаяДата());							 
	ЗапросВыборка.УстановитьПараметр("ИсполнительИспользовать", 		Пользователь <> Null);							 
	ЗапросВыборка.УстановитьПараметр("Исполнитель", 					?(ЗначениеЗаполнено(Пользователь), Пользователь, ПараметрыСеанса.ТекущийПользователь));
	ЗапросВыборка.УстановитьПараметр("СтруктурнаяЕдиницаИспользовать",  СтруктурнаяЕдиница <> Null);
	ЗапросВыборка.УстановитьПараметр("СтруктурнаяЕдиница", 				?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница));
	Задача = ЗапросВыборка.Выполнить().Выгрузить();
	   
    Возврат Задача.ВыгрузитьКолонку("Ссылка");
   
КонецФункции

// Получить задачи для пользователя по клиенту
Функция ПолучитьТекущиеЗадачиДляПользователяПоПосещениюКлиента(Клиент, Пользователь = Неопределено, СтруктурнаяЕдиница = Неопределено) Экспорт
	
	ЗапросВыборка = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                             |	ЗадачаПользователей.Ссылка
	                             |ИЗ
	                             |	Задача.ЗадачаПользователей КАК ЗадачаПользователей
	                             |ГДЕ
	                             |	ЗадачаПользователей.Выполнена = ЛОЖЬ
								 |	И ЗадачаПользователей.ПометкаУдаления = ЛОЖЬ
	                             |	И ЗадачаПользователей.НапоминаниеИспользовать = ИСТИНА
								 |	И ЗадачаПользователей.НапоминаниеРежим = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ПоСобытию)
								 |	И ЗадачаПользователей.ЗадачаПредмет = &Клиент
	                             |	И ВЫБОР
	                             |		КОГДА &ИсполнительИспользовать = ИСТИНА
	                             |			ТОГДА ВЫБОР
	                             |					КОГДА ЗадачаПользователей.Исполнитель ССЫЛКА Справочник.Пользователи И ЗадачаПользователей.Исполнитель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	                             |						ТОГДА ЗадачаПользователей.Исполнитель = &Исполнитель
	                             |					КОГДА ЗадачаПользователей.Исполнитель ССЫЛКА Справочник.ГруппыПользователей И ЗадачаПользователей.Исполнитель <> ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ПустаяСсылка)
	                             |						ТОГДА &Исполнитель В
	                             |								(ВЫБРАТЬ
	                             |									СоставГруппыПользователей.Пользователь
	                             |								ИЗ
	                             |									Справочник.ГруппыПользователей.Состав КАК СоставГруппыПользователей
	                             |								ГДЕ
	                             |									СоставГруппыПользователей.Ссылка = ЗадачаПользователей.Исполнитель)
	                             |							ИЛИ ЗадачаПользователей.Исполнитель = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	                             |					ИНАЧЕ ИСТИНА
	                             |				КОНЕЦ
	                             |		ИНАЧЕ ИСТИНА
	                             |		КОНЕЦ								 
	                             |	И ВЫБОР
	                             |			КОГДА &СтруктурнаяЕдиницаИспользовать = ИСТИНА
	                             |				ТОГДА ЗадачаПользователей.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                             |			ИНАЧЕ ИСТИНА
	                             |		КОНЕЦ");
	
	ЗапросВыборка.УстановитьПараметр("Клиент",							Клиент);							 
	ЗапросВыборка.УстановитьПараметр("ИсполнительИспользовать", 		Пользователь <> Null);							 
	ЗапросВыборка.УстановитьПараметр("Исполнитель", 					?(ЗначениеЗаполнено(Пользователь), Пользователь, ПараметрыСеанса.ТекущийПользователь));
	ЗапросВыборка.УстановитьПараметр("СтруктурнаяЕдиницаИспользовать",  СтруктурнаяЕдиница <> Null);
	ЗапросВыборка.УстановитьПараметр("СтруктурнаяЕдиница", 				?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница));
	Задача = ЗапросВыборка.Выполнить().Выгрузить();
	   
    Возврат Задача.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Полуить неактивные задачи для пользователя
//
Функция ПолучитьСписокНеАктивныхЗадачПользователя() Экспорт
	
	ЗапросВыборка = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                             |	ЗадачаПользователей.Ссылка
	                             |ИЗ
	                             |	Задача.ЗадачаПользователей КАК ЗадачаПользователей
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                             |			ГруппыПользователейСостав.Пользователь КАК Пользователь,
	                             |			ГруппыПользователейСостав.Ссылка КАК Ссылка
	                             |		ИЗ
	                             |			Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав) КАК ВложенныйЗапрос
	                             |		ПО (ВЫБОР
	                             |				КОГДА ЗадачаПользователей.Исполнитель ССЫЛКА Справочник.ГруппыПользователей
	                             |					ТОГДА ЗадачаПользователей.Исполнитель = ВложенныйЗапрос.Ссылка.Ссылка
	                             |				ИНАЧЕ ЛОЖЬ
	                             |			КОНЕЦ)
	                             |ГДЕ
	                             |	ВЫБОР
	                             |			КОГДА ЗадачаПользователей.Исполнитель ССЫЛКА Справочник.Пользователи
	                             |				ТОГДА ЗадачаПользователей.Исполнитель = &Исполнитель
	                             |			ИНАЧЕ ВЫБОР
	                             |					КОГДА ЗадачаПользователей.Исполнитель = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	                             |						ТОГДА ИСТИНА
	                             |					ИНАЧЕ &Исполнитель В (ВложенныйЗапрос.Пользователь)
	                             |				КОНЕЦ
	                             |		КОНЕЦ
	                             |	И ЗадачаПользователей.Выполнена = ЛОЖЬ
	                             |	И ЗадачаПользователей.НапоминаниеИспользовать = ЛОЖЬ");
	
	
	ЗапросВыборка.УстановитьПараметр("Исполнитель", ПараметрыСеанса.ТекущийПользователь);
	Задача = ЗапросВыборка.Выполнить().Выгрузить();
	   
    Возврат Задача.ВыгрузитьКолонку("Ссылка");	
	
КонецФункции

// Получить выполненые задачи для пользователя
//
Функция ПолучитьСписокВыполненныхЗадачПользователя() Экспорт
	
	ЗапросВыборка = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                             |	ЗадачаПользователей.Ссылка
	                             |ИЗ
	                             |	Задача.ЗадачаПользователей КАК ЗадачаПользователей
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                             |			ГруппыПользователейСостав.Пользователь КАК Пользователь,
	                             |			ГруппыПользователейСостав.Ссылка КАК Ссылка
	                             |		ИЗ
	                             |			Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав) КАК ВложенныйЗапрос
	                             |		ПО (ВЫБОР
	                             |				КОГДА ЗадачаПользователей.Исполнитель ССЫЛКА Справочник.ГруппыПользователей
	                             |					ТОГДА ЗадачаПользователей.Исполнитель = ВложенныйЗапрос.Ссылка.Ссылка
	                             |				ИНАЧЕ ЛОЖЬ
	                             |			КОНЕЦ)
	                             |ГДЕ
	                             |	ВЫБОР
	                             |			КОГДА ЗадачаПользователей.Исполнитель ССЫЛКА Справочник.Пользователи
	                             |				ТОГДА ЗадачаПользователей.Исполнитель = &Исполнитель
	                             |			ИНАЧЕ ВЫБОР
	                             |					КОГДА ЗадачаПользователей.Исполнитель = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	                             |						ТОГДА ИСТИНА
	                             |					ИНАЧЕ &Исполнитель В (ВложенныйЗапрос.Пользователь)
	                             |				КОНЕЦ
	                             |		КОНЕЦ
	                             |	И ЗадачаПользователей.Выполнена = ИСТИНА");
	
	
	ЗапросВыборка.УстановитьПараметр("Исполнитель", ПараметрыСеанса.ТекущийПользователь);
	Задача = ЗапросВыборка.Выполнить().Выгрузить();
	   
    Возврат Задача.ВыгрузитьКолонку("Ссылка");	
	
КонецФункции

#КонецОбласти
